ORG 0x7c00
[SECTION .text]
[BITS 16]

global _start
_start:

    ; -----------------------------------------------------
    ; 初始化段寄存器
    ; -----------------------------------------------------
    ; 主板通电，会进入到内存0xFFFF0执行第一行指令:
    ;   jmp f000:e05b
    ;   即正式进入BIOS程序（其中包括初始化中断向量表、检测硬件等一系列初始化操作）
    ; BIOS执行结束后，会执行交接指令：
    ;   jmp 0:0x7c00
    ;   即正式进入MBR程序，所以此时cs=0
    ; -----------------------------------------------------
    mov ax, cs
    mov ds, ax
    mov es, ax
    mov fs, ax
    mov gs, ax
    mov ss, ax

    ; -----------------------------------------------------
    ; 10H中断 0号功能 设置显示模式（可达到清屏的效果）
    ; -----------------------------------------------------
    ; 输入：
    ;   AH => 功能号
    ;   AL => 显示模式
    ;        ----------------------------
    ;        | AL | 模式 |  分辨率  | 颜色 |
    ;        |---------------------------|
    ;        | 00 | 文字 | 40*25   |  2  |
    ;        | 01 | 文字 | 40*25   |  16 |
    ;        | 02 | 文字 | 80*25   |  2  |
    ;        | 03 | 文字 | 80*25   |  16 |
    ;        | 04 | 图形 | 320*200 |  2  |
    ;        | 05 | 图形 | 320*200 |  4  |
    ;        | 06 | 图形 | 640*200 |  2  |
    ;        ----------------------------
    ; -----------------------------------------------------
    ; 输出：
    ;   AL => 显示模式标志/CRT控制模式字节
    ; ----------------------------------
    mov ax, 3
    int 0x10

    mov si, msg
    call print

    jmp $

; ------------------------
; 打印字符串
; ------------------------
; 参数：
;   si => 字符串起始地址（以\0标识字符串结尾）
; ------------------------
print:
    ; -----------------------------------------------------
    ; 10H中断 EH号功能 输出字符(光标跟随字符移动)
    ; -----------------------------------------------------
    ; 输入：
    ;   AH => 功能号
    ;   AL => 字符
    ;   BH => 页码
    ;   BL => 前景色
    ; -----------------------------------------------------
    ; 输出：
    ;   无
    ; ----------------------------------
    mov ah, 0x0e
    mov bx, 0x0001
.loop:
    mov al, [si]
    cmp al, 0
    jz .done
    int 0x10
    inc si
    jmp .loop
.done:
    ret

msg db "Hello MBR!", 10, 13, 0

TIMES 510-($-$$) DB 0
DW 0xAA55