[SECTION .text]
[bits 32]

extern syscall_table

; ---------------------------------------------------------------------------------------
; 系统调用入口
; ---------------------------------------------------------------------------------------
; 暂时约定使用寄存器传值:
; -----------------------------------------------------
;     eax: 调用号
;     ebx: 第一个参数
;     ecx: 第二个参数
;     edx: 第三个参数
; ---------------------------------------------------------------------------------------
global interrupt_handler_system_call
interrupt_handler_system_call:

    mov edi, syscall_table
    mov eax, [edi + eax * 4] ; 通过调用号找到函数

    push edx
    push ecx
    push ebx
    call eax

    add esp, 4 * 3

    iret

